src/DataProcessors/леТранспорт/леТранспорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>леТранспорт</name>
  <attributes>
    <name>АдресСервера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/DataProcessors/леТранспорт/ObjectModule.bsl
Функция ОтправитьПоFTP(Адрес, Данные) Экспорт
			
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("ledata");
	
	Текст = Новый ЗаписьТекста(ИмяВременногоФайла);
	Текст.Записать(Данные);
	Текст.Закрыть();
	Текст = Неопределено;
	
	Соединение = СоединениеFTP(Адрес);
	ПереслатьНаFTP(Соединение, ИмяВременногоФайла);
	
	УдалитьФайлы(ИмяВременногоФайла);
	
КонецФункции

Функция ПолучитьПоFTP(Адрес) Экспорт
	
	РазобратьАдрес(Адрес);
	
	Соединение = СоединениеFTP(Адрес);
	
	Если Соединение = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("ledata");	
	
	ПервыйСлеш = Найти(АдресСервера, "/");
	Файлы = Соединение.НайтиФайлы(Сред(АдресСервера, ПервыйСлеш), "*.ledata", Истина);
	
	Для Каждого Файл Из Файлы Цикл
	//классический вариант
	//первый параметр - что скачать, второй параметр - куда скачать
		Соединение.Получить(Файл.ПолноеИмя, ИмяВременногоФайла);
		
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		ТекстовыйДокумент.Прочитать(ИмяВременногоФайла);
		Текст = ТекстовыйДокумент.ПолучитьТекст();
		
		ТекстовыйДокумент = Неопределено;
		
		ТаймШтамп = Файл.ИмяБезРасширения;
		//ТаймШтамп = СтрЗаменить(ТаймШтамп, ШаблонИмениФайла, "");
		ТаймШтамп = Число(СтрЗаменить(ТаймШтамп, " ", ""));

		СМП_ОнлайнОбменУправлениеОчередями.ПоместитьСообщениеВОчередьВходящих(Текст, ТаймШтамп);
		
		Соединение.Удалить(Файл.ПолноеИмя);
		
	КонецЦикла;
	
	УдалитьФайлы(ИмяВременногоФайла);

	////вариант с использованием потока
	////первый параметр - что скачать, воторой параметр - поток в который будут помещены полученные данные 
	//Поток = Новый ФайловыйПоток("D:\file.txt", РежимОткрытияФайла.СоздатьНовый, ДоступКФайлу.ЧтениеИЗапись);
	//Соединение.Получить("/test_folder_1/file_1.txt",Поток);
	
КонецФункции

Функция РазобратьАдрес(Адрес)
	
	Начало = СтрНайти(Адрес, ":") + 3;
	Конец  = СтрНайти(Адрес, "@");
	
	ЛогинПароль = Сред(Адрес, Начало, Конец-Начало);
	ЛогинПароль = СтрРазделить(ЛогинПароль, ":");
	
	Логин = ЛогинПароль[0];
	Пароль = ЛогинПароль[1];
	
	АдресСервера = СтрРазделить(Адрес, "@")[1];
	АдресСервера = СтрЗаменить(АдресСервера, "\", "/");
	
КонецФункции

Функция ОтправитьПоHTTP() Экспорт
	
КонецФункции

Функция ОтправитьВКаталог() Экспорт
	
КонецФункции

Функция СоединениеFTP(Адрес)
	
	Если Не ЗначениеЗаполнено(Адрес) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РазобратьАдрес(Адрес);
	
	ПервыйСлеш = Найти(АдресСервера, "/");
	//самый минималистичный вариант для анонимного пользователя
	//Соединение = Новый FTPСоединение(АдресСервера);

	//если номер порта стандартный, то его можно не указывать
	//стандартные номера портов: 21 - FTP и 990 - FTPS 
	Соединение = Новый FTPСоединение(Лев(АдресСервера, ПервыйСлеш-1),,Логин,Пароль,,Истина);

	//пассивное соединение с таймаутом 10 секунд
	//Соединение = Новый FTPСоединение("localhost",21,"login","password",,Истина,10);
		
	Возврат Соединение;
	
КонецФункции

Функция ПереслатьНаFTP(Соединение, ИмяФайла)
	
	Если Соединение = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПервыйСлеш = Найти(АдресСервера, "/");
	Соединение.УстановитьТекущийКаталог(Сред(АдресСервера, ПервыйСлеш));
	
	//вариант с использованием потока
	//первый параметр - куда передать, воторой параметр - поток из которого взять данные
	Поток = Новый ФайловыйПоток(ИмяФайла, РежимОткрытияФайла.Открыть, ДоступКФайлу.Чтение);
	Соединение.Записать("" + ТекущаяУниверсальнаяДатаВМиллисекундах() +".ledata", Поток);
	
	Поток = Неопределено;
	
КонецФункции
